stubs/libxml2/samples/e1d37720fffe37700f391072191bcafc6cf39f3a

<log:log xmlns:log="http://www.w3.org/2002/ws/addressing/logs/"><log:message testcase="test1150" message="1"><log:content><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">http://131.107.72.15/WSAddressingCR_Service_WCF/WSAddressing10.svc/Soap11/Duplex</wsa:To><wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">http://example.org/action/echoIn</wsa:Action><wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">AUID:edd69e5710fae3d7</wsa:MessageID><wsa:From xmlns:wsa="http://www.w3.org/2005/08/addressing"><wsa:Address>http://213.162.124.157:8080/interop/soap/InteropTest</wsa:Address></wsa:From><wsa:ReplyTo xmlns:wsa="http://www.w3.org/2005/08/addressing"><wsa:Address>http://213.162.124.157:8080/interop/soap/InteropTest</wsa:Address></wsa:ReplyTo></soap:Header><soap:Body><echo:echoIn xmlns:echo="http://example.org/echo">echo message</echo:echoIn></soap:Body></soap:Envelope></log:content></log:message><log:message testcase="test1150" message="3"><log:content><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:a="http://www.w3.org/2005/08/addressing"><s:Header><a:Action s:mustUnderstand="1">http://example.org/action/echoOut</a:Action><a:RelatesTo>AUID:edd69e5710fae3d7</a:RelatesTo><a:To s:mustUnderstand="1">http://213.162.124.157:8080/interop/soap/InteropTest</a:To></s:Header><s:Body><echoOut xmlns="http://example.org/echo">echo message</echoOut></s:Body></s:Envelope></log:content></log:message></log:log>